{
  "Полный гид по модулю collections в Python": {
    "time": "2024-12-19, 17:18",
    "href": "https://habr.com/ru/articles/868086/",
    "description": "Туториал посвящён полезным инструментам из модуля collections в Python, которые помогают решать типовые задачи программирования быстро и эффективно."
  },
  "«Народный леспол» — годная репродукция или поделка на тему?": {
    "time": "2024-12-19, 16:01",
    "href": "https://habr.com/ru/companies/ruvds/articles/862570/",
    "description": "\n\r\nПривет, Хабр! Сегодня я расскажу о недорогой китайской электрогитаре, довольно качественно повторяющей особенности подписного инструмента Лестера Пола от одной известной американской компании.\n\nРечь пойдёт о Harley-Benton SC-450Plus VB Vintage Series. Попутно мы разберёмся, в чём смысл следования оригинальным спецификациям и как взаимодействуют между собой компоненты этого инструмента.\r\nГитара имеет один удручающий недостаток и две особенности, которые подойдут не каждому гитаристу. Недостаток и одну из особенностей можно устранить."
  },
  "Сборка RPM-пакетов в ALT Linux: автоматизация с помощью GEAR": {
    "time": "2024-12-19, 15:16",
    "href": "https://habr.com/ru/articles/867902/",
    "description": "В первой части материала мы разобрали случай сборки простого rpm-пакета в ALT Linux. За пример брали набор файлов изображений и собирали стандартной утилитой rpmbuild.В этом материале поговорим про сборку python-проекта специальным инструментом — GEAR. Этот инструмент разработала команда сообщества Альт для автоматизации процесса сборки.Общими словами, GEAR — это удобная обвязка вокруг Git и rpmbuild. Достаточно в дополнение к spec-инструкции написать GEAR-правила формирования архива, полученного из git-репозитория.Материал статьи может быть полезен при изучении темы сборки rpm-пакета инструментом gear-rpm в ОС «Альт». "
  },
  "Защита схемы от переполюсовки, что может быть проще?": {
    "time": "2024-12-19, 11:05",
    "href": "https://habr.com/ru/companies/timeweb/articles/864326/",
    "description": "\r\n«Я не такая», «со мной этого точно не может случиться» — говорили они, но упорно продолжали пихать батарейки в пульт для телевизора не той стороной… \n\r\nПри проектировании многих схем, особенно со сменным батарейным питанием, наличие защиты от переполюсовки в них ну просто обязано быть. И если вы уверены, что для решения данной проблемы достаточно одного диода, эта статья написана точно для вас. Мы подробно рассмотрим и проведем моделирование нескольких схем защиты от переполюсовки, оценим возможности их применения. В заключении я сформулирую краткую дорожную карту по выбору варианта схемотехнического решения под конкретный случай.\n\n❯ Содержание:\n\n1. Механическая защита\n2. Последовательное включение диода\n3. Параллельное подключение диода\n4. Диодный мост\n5. SBR — диоды\n6. Релейная защита\n7. Схема защиты на полевом транзисторе P-типа\n8. Полевой транзистор N-типа с бустерной накачкой затвора\n9. Биполярные транзисторы в качестве защиты от переполюсовки\n\r\nВсех неравнодушных к электронике прошу под кат!"
  },
  "Парсинг поисковой выдачи Google по ключевым словам — подробный гайд как сделать парсер Гугл (аналог вордстат в Гугл)": {
    "time": "2024-12-19, 10:31",
    "href": "https://habr.com/ru/articles/867876/",
    "description": "Любой SEO специалист знает, какая боль собирать семантику для Гугла. Одно дело, когда запросы можно пересчитать по пальцам, а когда они исчисляются тысячами, а не штуками? Как посмотреть количество запросов в Гугл по ключевым словам? Честно говоря, когда речь заходит о десятках тысяч ключевых слов, становится не по себе — голова идёт кругом, руки тянутся к старым привычным инструментам, а реальность бросает вызов. Так уж устроен сегодняшний Google Ads: привычная связка Key Collector + Google Ads + несколько прокси больше не спасает. Наступает новая эпоха, где без прямого обращения к официальному API всё становится мрачно и сложно."
  }
}